/* REXX */
PULL INFILE
LEN = LENGTH(INFILE)

INFILE=INFILE||ODATE
ADDRESS TSO
INFILE="'HECR01.PDS.JOB'"
OUTFILE="'HERC01.PDS.JOB2'"
"ALLOC DA("INFILE") F(DATAIN) SHR REUSE"
"ALLOC DA("OUTFILE") F(DATAOUT) MOD REUSE"
"NEWSTACK"
"EXECIO * DISKR DATAIN (FNIS"
"EXECIO * DISKW DATAOUT (FNIS"
"DELSTACK"
"FREE F(DATAIN DATAOUT)"
